app/Models/CategoryModel.php

    public function getAllCategories()
    {
        return $this->select("name, category_id")
                ->get()->getResultArray();
---
SELECT `name`, `category_id`
FROM `category`