app/Models/ProductModel.php

   public function getAllProducts()
   {
       return $this->findAll();
---
SELECT *
FROM `product`

    public function getAllProductsSearch($searchArray)
    {
        $this->select('*');
        if(isset($searchArray['title']))
        {
            $this->like('title', $searchArray['title'], 'both');
        }
        if(isset($searchArray['description']))
        {
            $this->like('description', $searchArray['description'], 'both');
        }
        return $this->get()->getResultArray();
---
SELECT *
FROM `product`

    public function getProductByID($productID)
    {
        return $this->select("product.*, admin.name as admin name, category.name as category_name")
                    ->join('admin', 'admin.admin_id = product.admin_id', 'inner')
                    ->join('category', 'product.category_id = category.category_id', 'inner')
                    ->where('product_id', $productID)
                    ->get()->getRowArray();
---
SELECT `product`.*, `admin`.`name` as `admin name`, `category`.`name` as `category_name`
FROM `product`
INNER JOIN `admin` ON `admin`.`admin_id` = `product`.`admin_id`
INNER JOIN `category` ON `product`.`category_id` = `category`.`category_id`
WHERE `product_id` = '1'

    public function getNumberOfItemsCategory($categoryID)
    {
        return $this->select ("COUNT(*) as numberOfItems" )
            ->where('category_id', $categoryID)
            ->get()
            ->getRow()
            ->numberOfItems;
---
SELECT COUNT(*) as numberOfItems
FROM `product`
WHERE `category_id` = '1'